priv/static/doc/html/elements/tabs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Tabs Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-06 22:43:50 GMT"/>
<meta name="author" content="Roman Shestakov (@rshestakov)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Tabs Element</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Tabs Element - #tabs {} </a>
<ul>
<li><a href="#sec-1.1">1.1 Usage </a></li>
<li><a href="#sec-1.2">1.2 Attributes </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tabs Element - #tabs {} </h2>
<div class="outline-text-2" id="text-1">


<p>
The implementation of jQuery tabs element.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="example">
#tabs{
    id = tabs,
    options = [{selected, 0}],
    tabs = [
        #tab{title = "Tab 1", url = "/content/tabs2.htm"},
        #tab{title = "Tab 2", body = ["Tab two body... Proin elit arcu, rutrum commodo, vehicula tempus, commodo a, risus. Curabitur nec arcu. Donec sollicitudin mi sit amet mauris. Nam elementum quam ullamcorper ante. Etiam aliquet massa et lorem. Mauris dapibus lacus auctor risus. Aenean tempor ullamcorper leo. Vivamus sed magna quis ligula eleifend adipiscing. Duis orci. Aliquam sodales tortor vitae ipsum. Aliquam nulla. Duis aliquam molestie erat. Ut et mauris vel pede varius sollicitudin. Sed ut dolor nec orci tincidunt interdum. Phasellus ipsum. Nunc tristique tempus lectus."]},
        #tab{title = "Tab 3", body = ["Tab three body... Proin elit arcu, rutrum commodo, vehicula tempus, commodo a, risus. Curabitur nec arcu. Donec sollicitudin mi sit amet mauris. Nam elementum quam ullamcorper ante. Etiam aliquet massa et lorem. Mauris dapibus lacus auctor risus. Aenean tempor ullamcorper leo. Vivamus sed magna quis ligula eleifend adipiscing. Duis orci. Aliquam sodales tortor vitae ipsum. Aliquam nulla. Duis aliquam molestie erat. Ut et mauris vel pede varius sollicitudin. Sed ut dolor nec orci tincidunt interdum."]}
    ],
    actions =
    [
        #tab_event_on{trigger = tabs, type = ?EVENT_TABS_ACTIVATE, postback = {Tag, {tabs, ?EVENT_TABS_ACTIVATE}}},
        #tab_event_on{trigger = tabs, type = ?EVENT_TABS_BEFORE_ACTIVATE, postback = {Tag, {tabs, ?EVENT_TABS_BEFORE_ACTIVATE}}},
        #tab_event_on{trigger = tabs, type = ?EVENT_TABS_BEFORE_LOAD, postback = {Tag, {tabs, ?EVENT_TABS_BEFORE_LOAD}}},
        #tab_event_on{trigger = tabs, type = ?EVENT_TABS_CREATE, postback = {Tag, {tabs, ?EVENT_TABS_CREATE}}},
        #tab_event_on{trigger = tabs, type = ?EVENT_TABS_LOAD, postback = {Tag, {tabs, ?EVENT_TABS_LOAD}}}
    ]
}


</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>tabs - (<i>list of #tab{} elements</i>)</dt><dd>
Set the tabs that will be rendered within this tabs.

</dd>
<dt>options - (<i>list of tuples</i>)</dt><dd>
Options which are set during tabs initialization.

</dd>
<dt>title - (<i>string</i>)</dt><dd>
Set the tab title.

</dd>
<dt>body - (<i>string</i>)</dt><dd>
Set the tab body.

</dd>
<dt>url - (<i>string</i>)</dt><dd>
url of the page which will be loaded
dynamically into the body of the tab element.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Roman Shestakov (@rshestakov)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2013-02-06 22:43:50 GMT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
